belkinsky/itlab01/src/STM32-E407_blink_FLASH/pinConfig_MicroXplorer.ioc
#MicroXplorer Configuration settings - do not modify
#Thu Dec 12 23:36:00 AMT 2013
File.Version=1
KeepUserPlacement=true
Mcu.Family=STM32F4
Mcu.IP0=TIM3
Mcu.IP1=USART1
Mcu.IPNb=2
Mcu.Name=STM32F407Z(E-G)Tx
Mcu.Package=LQFP144
Mcu.Pin0=PC13
Mcu.Pin1=PA5
Mcu.Pin2=PA6
Mcu.Pin3=PB0
Mcu.Pin4=PB1
Mcu.Pin5=PG8
Mcu.Pin6=PB5
Mcu.Pin7=PB6
Mcu.Pin8=PB7
Mcu.PinsNb=9
PA5.GPIOParameters=GPIO_PuPd,GPIO_Mode
PA5.GPIO_Mode=GPIO_Mode_IN
PA5.GPIO_PuPd=GPIO_PuPd_UP
PA5.Signal=GPIO_Input
PA6.Mode=PWM-Generation
PA6.Signal=TIM3_CH1
PB0.Mode=PWM-Generation
PB0.Signal=TIM3_CH3
PB1.Mode=PWM-Generation
PB1.Signal=TIM3_CH4
PB5.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Mode,GPIO_OType
PB5.GPIO_Mode=GPIO_Mode_AF
PB5.GPIO_OType=GPIO_OType_PP
PB5.GPIO_PuPd=GPIO_PuPd_NOPULL
PB5.GPIO_Speed=GPIO_Speed_2MHz
PB5.Mode=PWM-Generation
PB5.Signal=TIM3_CH2
PB6.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Mode,GPIO_OType
PB6.GPIO_Mode=GPIO_Mode_AF
PB6.GPIO_OType=GPIO_OType_PP
PB6.GPIO_PuPd=GPIO_PuPd_NOPULL
PB6.GPIO_Speed=GPIO_Speed_2MHz
PB6.Mode=Asynchronous
PB6.Signal=USART1_TX
PB7.GPIOParameters=GPIO_Speed,GPIO_PuPd,GPIO_Mode,GPIO_OType
PB7.GPIO_Mode=GPIO_Mode_AF
PB7.GPIO_OType=GPIO_OType_PP
PB7.GPIO_PuPd=GPIO_PuPd_NOPULL
PB7.GPIO_Speed=GPIO_Speed_2MHz
PB7.Mode=Asynchronous
PB7.Signal=USART1_RX
PC13.Signal=GPIO_Output
PG8.Signal=GPIO_Input
